In [ ]:
PROJECT- HR EMPLOYEE DISTRIBUTION DATA ANALYSIS BY USING MYSQL WORKBENCH AND DATA VISUALIZATION TOOL POWER BI.

## DATA CLEANING AND PREPROCESSING

In [ ]:
SELECT * FROM hrdb.humanresources;
ALTER TABLE humanresources
CHANGE COLUMN ï»¿id empId VARCHAR(20)NULL;
Describe humanresources;

SELECT birthdate from humanresources;

Set sql_safe_updates=0;

UPDATE humanresources
SET birthdate=CASE
  WHEN birthdate LIKE'%/%'THEN date_format(STR_TO_DATE(birthdate,'%m/%d/%Y'),'%Y-%m-%d')
  WHEN birthdate LIKE'%-%'THEN date_format(STR_TO_DATE(birthdate,'%m-%d-%Y'),'%Y-%m-%d')
  Else Null
End;

ALTER TABLE humanresources
MODIFY COLUMN birthdate DATE;

UPDATE humanresources
SET hire_date=CASE
  WHEN hire_date LIKE'%/%'THEN date_format(STR_TO_DATE(hire_date,'%m/%d/%Y'),'%Y-%m-%d')
  WHEN hire_date LIKE'%-%'THEN date_format(STR_TO_DATE(hire_date,'%m-%d-%Y'),'%Y-%m-%d')
  Else Null
End;
ALTER TABLE humanresources
MODIFY COLUMN hire_date DATE;

SELECT hire_date FROM humanresources;

UPDATE humanresources
SET termdate=date(str_to_date(termdate,'%Y-%m-%d %H:%i:%sUTC'))
WHERE termdate IS NOT NULL AND termdate!= '';

DELETE FROM humanresources WHERE termdate='0000-00-00';

In [ ]:
SELECT termdate FROM humanresources;

ALTER TABLE humanresources
MODIFY COLUMN termdate DATE;

ALTER TABLE humanresources ADD COLUMN age INT;

UPDATE humanresources
SET age=timestampdiff(year,birthdate,curdate());

SELECT birthdate,age FROM humanresources;

SELECT 
   min(age) as youngest,
   max(age) as oldest
FROM humanresources;

SELECT COUNT(*)
FROM humanresources
WHERE age<18;

### 1 What is the gender breakdown of employees in the company?

In [ ]:
SELECT gender,COUNT(*) as count
FROM humanresources
WHERE age>=18 AND termdate IS NULL
GROUP BY gender;

gender           count

Male              8911
Female            8090
Non-Conforming    481

## 2. what is the race ethnicity breakdown of the employrees in the company?

In [ ]:
SELECT race, COUNT(*) as count
FROM humanresources
WHERE age>=18 AND termdate IS NULL
GROUP BY race
ORDER BY COUNT(*) DESC;

race                                             count

White                                            4987
Two or More Races                                2867
Black or African American                        2840
Asian                                            2791
Hispanic or Latino                               1994
American Indian or Alaska Native                 1051
Native Hawaiian or Other Pacific Islander        952

## 3.What is the age distribution of the employees in the company?

In [ ]:
SELECT 
 min(age) as youngest,
 max(age) as oldest
FROM humanresources
WHERE age>=18 AND termdate IS NULL;


SELECT CASE
 WHEN age>=18 AND age<=24 THEN '18-24'
 WHEN age>=25 AND age<=34 THEN '25-34'
 WHEN age>=35 AND age<=44 THEN '35-44'
 WHEN age>=45 AND age<=54 THEN '45-54'
 WHEN age>=55 AND age<=64 THEN '55-64'
 ELSE '65+'
 END as age_group,
 COUNT(*) as count
FROM humanresources
WHERE age>=18 AND termdate IS NULL
GROUP BY age_group
ORDER BY age_group;

age_group         count

18-24             2040
25-34             5004
35-44             4966
45-54             4659
55-64             813

In [ ]:
SELECT CASE
 WHEN age>=18 AND age<=24 THEN '18-24'
 WHEN age>=25 AND age<=34 THEN '25-34'
 WHEN age>=35 AND age<=44 THEN '35-44'
 WHEN age>=45 AND age<=54 THEN '45-54'
 WHEN age>=55 AND age<=64 THEN '55-64'
 ELSE '65+'
 END as age_group,gender,
 COUNT(*) as count
FROM humanresources
WHERE age>=18 AND termdate IS NULL
GROUP BY age_group,gender
ORDER BY age_group,gender;

age_group             gender                 count

18-24                 Female                  929
18-24                 Male                    1061
18-24                 Non-Conforming          50
25-34                 Female                  2370
25-34                 Male                    2498
25-34                 Non-Conforming          136
35-44                 Female                  2214
35-44                 Male                    2614
35-44                 Non-Conforming          138
45-54                 Female                  2180
45-54                 Male                    2343
45-54                 Non-Conforming          136
55-64                 Female                  397
55-64                 Male                    395
55-64                 Non-Conforming          21

## 4 How many employees work at headquaters versus remote location?

In [ ]:
SELECT location,count(*) as count
FROM humanresources
WHERE age>=18 AND termdate IS NULL
GROUP BY location;

location             count

Headquarters         13107
Remote               4375

## 5 What is the average length of employment for employees who have been terminated?

In [ ]:
SELECT round(avg(datediff(termdate,hire_date))/365,0) as avg_length_employment
FROM humanresources
WHERE termdate<=curdate() AND termdate <> '0000-00-00' AND age>18;

avg_length_employment

8

## 6 How does the gender distribution varies accross the department and job titles?

In [ ]:
SELECT department,gender, COUNT(*) as count
FROM humanresources
WHERE termdate IS NULL AND age>18
GROUP BY department,gender
ORDER BY department;

department                                    gender                                         count

Accounting                                    Female                                         1175
Accounting                                    Male                                           1375
Accounting                                    Non-Conforming                                 76
Auditing                                      Female                                         19
Auditing                                      Male                                           19
Business Development                          Female                                         593
Business Development                          Male                                           672
Business Development                          Non-Conforming                                 42
Engineering                                   Female                                         2442
Engineering                                   Male                                           2671
Engineering                                   Non-Conforming                                 146
Human Resources                               Female                                         672
Human Resources                               Male                                           721
Human Resources                               Non-Conforming                                 37
Legal                                         Female                                         107
Legal                                         Male                                           125
Legal                                         Non-Conforming                                 5
Marketing                                     Female                                         206
Marketing                                     Male                                           199
Marketing                                     Non-Conforming                                 5
Product Management                            Female                                         227
Product Management                            Male                                           272
Product Management                            Non-Conforming                                 13
Research and Development                      Female                                         404
Research and Development                      Male                                           401
Research and Development                      Non-Conforming                                 25
Sales                                         Female                                         648
Sales                                         Male                                           739
Sales                                         Non-Conforming                                 39
Services                                      Female                                         647
Services                                      Male                                           661
Services                                      Non-Conforming                                 29
Support                                       Female                                         337
Support                                       Male                                           368
Support                                       Non-Conforming                                 27
Training                                      Female                                         613
Training                                      Male                                           688
Training                                      Non-Conforming                                 37

## 7 What is the distribution of job titles accross the company?

In [ ]:
SELECT jobtitle,gender,count(*) as count
FROM humanresources
WHERE termdate IS NULL AND age>=18
GROUP BY jobtitle,gender 
ORDER BY jobtitle;

## 8 Which department has the highest turnover rate?

In [ ]:
SELECT department,terminated_count,total_count,terminated_count/total_count as termination_rate
FROM
 (SELECT department,count(*) as total_count,
   sum(CASE WHEN termdate<>'0000-00-00' AND termdate<curdate() THEN 1 ELSE 0 END) as terminated_count
  FROM humanresources
  WHERE age>=18
  GROUP BY department
  ) as subquery
ORDER BY termination_rate DESC;

department              terminated_count            total_count                termination_rate

Auditing                       8                        50                             0.16
Legal                          39                       299                            0.1304
Training                       188                      1622                           0.1159
Research and Development       114                      1032                           0.1105
Human Resources                190                      1727                           0.11
Accounting                     347                      3192                           0.1087
Sales                          188                      1745                           0.1077
Engineering                    684                      6387                           0.1071
Product Management             66                       623                            0.1059
Services                       171                      1618                           0.1057
Support                        92                       90                             0.1019
Business Development           146                      1569                           0.0931
Marketing                      43                       480                            0.0896

## 9 What is distribution of employee accross location by state?

In [ ]:
SELECT location_state, count(*) as count
FROM humanresources
WHERE age>=18 AND termdate IS NULL
GROUP BY location_state
ORDER BY count DESC;

location_state                  count

Ohio                              14144
Pennsylvania                      892
Illinois                          698
Michigan                          550
Indiana                           545
Kentucky                          347
Wisconsin                         306

## 10 How has the company's employee count changed over time based on hire and term dates?

In [ ]:
SELECT
 year,hires,termination,hires-termination as net_change,
 round((hires-termination)/hires*100,2) as net_change_percent
FROM
   ( 
   SELECT YEAR(hire_date)as year,
		  count(*) as hires,SUM(CASE WHEN termdate<>'0000-00-00' AND termdate<= curdate() THEN 1 ELSE 0 END) as termination
   FROM humanresources
   WHERE age>=18
   GROUP BY YEAR(hire_date)
   ) as subquery
ORDER BY year ASC;

year           hires                termination             net_change              net_change_percent

2000            211                    26                     185                         87.68
2001            1082                   197                    885                         81.79
2002            1012                   161                    851                         84.09
2003            1088                   187                    901                         82.81
2004            1087                   190                    897                         82.52
2005            1038                   166                    872                         84.01
2006            1069                   168                    901                         84.28
2007            1058                   137                    921                         87.05
2008            1061                   135                    926                         87.28
2009            1094                   139                    955                         87.29
2010            1050                   117                    933                         88.86
2011            1057                   107                    950                         89.88
2012            1059                   101                    958                         90.46
2013            1042                   87                     955                         91.65
2014            1014                   81                     933                         92.01
2015            1011                   68                     943                         93.27
2016            1076                   61                     1015                        94.33
2017            1043                   47                     996                         95.49
2018            1090                   41                     1049                        96.24
2019            1038                   41                     997                         96.05
2020            96                     19                     948                         98.04

## 11 What is the tenure distribution for each department?

In [ ]:
SELECT department, round(avg(datediff(termdate,hire_date)/365),0)as avg_tenure
FROM humanresources
WHERE age>=18 AND termdate< curdate() AND termdate<>'0000-00-00'
GROUP BY department

department                                  avg_tenure

Engineering                                     8
Services                                        8
Human Resources                                 7
Business Development                            7
Sales                                           8
Auditing                                        8
Training                                        7
Accounting                                      8
Research and Development                        8
Product Management                              6
Support                                         7
Legal                                           7
Marketing                                       8